app/controllers/shoes_controller.rb

  def index
    @shoes = Shoe.all
---
SELECT * FROM "shoes"

  def show
    @shoe = Shoe.find(params[:id])
---
SELECT * FROM "shoes" WHERE ("shoes"."id" = 168970625)

  def edit
    @shoe = Shoe.find(params[:id])
---
SELECT * FROM "shoes" WHERE ("shoes"."id" = 1)

  def update
    @shoe = Shoe.find(params[:id])

    respond_to do |format|
      if @shoe.update_attributes(params[:shoe])
---
SELECT * FROM "shoes" WHERE ("shoes"."id" = 168970625)
UPDATE "shoes" SET "size" = 44.0, "updated_at" = '2009-07-23 21:42:05' WHERE "id" = 168970625

  def destroy
    @shoe = Shoe.find(params[:id])
    @shoe.destroy
---
SELECT * FROM "shoes" WHERE ("shoes"."id" = 4)
DELETE FROM "shoes" WHERE "id" = 4